 000100        IDENTIFICATION DIVISION.                                         
 000200        PROGRAM-ID.                                                      
 000300            EAD95801.                                                    
 000400        AUTHOR.                                                          
 000500            LUCAS.                                                       
 000600       ********************************************                      
 000700       *        MEU PRIMEIRO PROGRAMA COBOL       *                      
 000800       ********************************************                      
 000900        ENVIRONMENT DIVISION.                                            
 001000       *                                                                 
 001100        DATA DIVISION.                                                   
 001200       *                                                                 
 001300        PROCEDURE DIVISION.                                              
 001400        UNICA SECTION.                                                   
 001500        INICIO.                                                          
 001600            DISPLAY 'MEU PRIMEIRO PROGRAMA COBOL'.                       
 001700            STOP RUN.                                                    
